### Data Consolidation and Enrichment: An ETL Pipeline for Excel Data using Python and MySQL

#### Overview
This ETL (Extract,Transform,Load) project involves extracting data from two Excel files using Python, transforming it by performing data cleaning and enrichment, and loading it into a MySQL database for structured storage and analysis.

#### Technologies Used

* Python 3.12.1
* Pandas Library
* MySQL Connector
* PyMySQL Library
* SqlAlchemy Library
* Openpyxl Library
* MySQL database

##### Key Steps:

1. **Extraction**:
    * Loaded two Excel files into Python using the Pandas and Openpyxl libraries.

2. **Transformation**:
    * Removed outliers to ensure data consistency.
    * Cleaned the value column by removing the '£' delimter using Regular Expression(re).
    * Converted relevant columns from string format to integer for proper numerical analysis.
    * Derived a new Month Name column from the Month column using Lambda functions and Calendar library to improve data readability.
    * Consolidated the clean and enriched datasets into a single Pandas DataFrame

3. **Loading**:
    * Established a connection to a MySQL databse using SQLAlchemy, MySQL Connector, and PyMySQL.
    * Loaded the transformed data into a MySQL table for further analysis and reporting.

##### Load Library

In [143]:
import pandas as pd
import openpyxl
import mysql.connector
import sqlalchemy
from sqlalchemy import create_engine
import pymysql
import calendar

##### Extract Data

In [144]:
df1= pd.read_excel("C:/Users/DELL/Desktop/DATASETS/COFFEE SALES/sales_2020.xlsx")
df1.head()

,Unnamed: 0,City coffee shop,Year,Month,Product category,Sales Volume Sales,Value
0,NaN,Southampton,2020,NaN,1 Coffee,91,£364
1,NaN,Southampton,2020,NaN,1 Hot drinks,46,£92
2,NaN,Southampton,2020,NaN,1 Cold drinks,60,£150
3,NaN,Southampton,2020,NaN,1 Cakes,23,£115
4,NaN,Southampton,2020,NaN,1 Sandwiches,19,£114

##### Data Profiling

In [145]:
df1.tail()

,Unnamed: 0,City coffee shop,Year,Month,Product category,Sales Volume Sales,Value
41,NaN,Southampton,2020,NaN,7 Pastry,65,£130
42,NaN,Southampton,2020,NaN,8 Coffee,135,£540
43,NaN,Southampton,2020,NaN,8 Hot drinks,63,£126
44,NaN,Southampton,2020,NaN,8 Cold drinks,77,£193
45,NaN,Southampton,2020,NaN,8 Cakes,44,£220

In [146]:
df1.columns

Index(['Unnamed: 0', 'City coffee shop', 'Year', 'Month', 'Product category',
       'Sales Volume   Sales', 'Value'],
      dtype='object')

In [147]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Unnamed: 0            0 non-null      float64
 1   City coffee shop      46 non-null     object
 2   Year                  46 non-null     int64
 3   Month                 0 non-null      float64
 4   Product category      46 non-null     object
 5   Sales Volume   Sales  46 non-null     object
 6   Value                 46 non-null     object
dtypes: float64(2), int64(1), object(4)
memory usage: 2.6+ KB

##### Data Preprocessing & Transformation

In [148]:
df1.drop(columns=['Unnamed: 0','Month'], inplace=True)
df1.columns

Index(['City coffee shop', 'Year', 'Product category', 'Sales Volume   Sales',
       'Value'],
      dtype='object')

In [149]:
df1[['Month','Product category']]= df1['Product category'].str.split(' ',n=1,expand=True)
df1= df1.rename(columns={'Product category': 'Product'})
df1= df1.rename(columns={'City coffee shop':'City'})
df1['Value']= df1['Value'].str.replace('£', '', regex=False)
df1= df1.rename(columns={'Sales Volume   Sales':'Quantity'})
df1.head()

          City  Year      Product Quantity Value Month
0  Southampton  2020       Coffee       91   364     1
1  Southampton  2020   Hot drinks       46    92     1
2  Southampton  2020  Cold drinks       60   150     1
3  Southampton  2020        Cakes       23   115     1
4  Southampton  2020   Sandwiches       19   114     1

In [150]:
df1['Quantity']= df1['Quantity'].replace('-','0')
df1['Value']= pd.to_numeric (df1['Value'])
df1['Month']= pd.to_numeric(df1['Month'])
df1['Quantity']= pd.to_numeric (df1['Quantity'])
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46 entries, 0 to 45
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   City      46 non-null     object
 1   Year      46 non-null     int64
 2   Product   46 non-null     object
 3   Quantity  46 non-null     int64
 4   Value     46 non-null     int64
 5   Month     46 non-null     int64
dtypes: int64(4), object(2)
memory usage: 2.3+ KB

In [151]:
df1.head()

          City  Year      Product  Quantity  Value  Month
0  Southampton  2020       Coffee        91    364      1
1  Southampton  2020   Hot drinks        46     92      1
2  Southampton  2020  Cold drinks        60    150      1
3  Southampton  2020        Cakes        23    115      1
4  Southampton  2020   Sandwiches        19    114      1

In [152]:
df1.tail()

           City  Year      Product  Quantity  Value  Month
41  Southampton  2020       Pastry        65    130      7
42  Southampton  2020       Coffee       135    540      8
43  Southampton  2020   Hot drinks        63    126      8
44  Southampton  2020  Cold drinks        77    193      8
45  Southampton  2020        Cakes        44    220      8

##### Extracting Second Data

In [153]:
df= pd.read_excel('C:/Users/DELL/Desktop/DATASETS/COFFEE SALES/sales_2020_to_2022.xlsx')
df.head()

   Unnamed: 0  Southampton  2020   8 Sandwiches   23  £138
0         NaN  Southampton  2020       8 Pastry   96  £192
1         NaN  Southampton  2020       9 Coffee  121  £484
2         NaN  Southampton  2020   9 Hot drinks   42   £84
3         NaN  Southampton  2020  9 Cold drinks   67  £168
4         NaN  Southampton  2020        9 Cakes   27  £135

##### Data Profiling

In [154]:
df.columns= ['Unnamed','City', 'Year','Product category','Quantity','Value']
df.columns

Index(['Unnamed', 'City', 'Year', 'Product category', 'Quantity', 'Value'], dtype='object')

##### Data Preprocessing & Transformation

In [155]:
df.drop(columns='Unnamed',inplace=True)
df.head()

          City  Year Product category Quantity Value
0  Southampton  2020         8 Pastry       96  £192
1  Southampton  2020         9 Coffee      121  £484
2  Southampton  2020     9 Hot drinks       42   £84
3  Southampton  2020    9 Cold drinks       67  £168
4  Southampton  2020          9 Cakes       27  £135

In [156]:
df[['Month','Product category']]= df['Product category'].str.split(' ',n=1,expand=True)
df.head()

          City  Year Product category Quantity Value Month
0  Southampton  2020           Pastry       96  £192     8
1  Southampton  2020           Coffee      121  £484     9
2  Southampton  2020       Hot drinks       42   £84     9
3  Southampton  2020      Cold drinks       67  £168     9
4  Southampton  2020            Cakes       27  £135     9

In [157]:
df['City'].unique()

array(['Southampton', 'Southam', 'Portsmouth', 'Blackpool'], dtype=object)

In [158]:
df['City']= df['City'].replace('Southam','Southampton')

In [159]:
df['City'].unique()

array(['Southampton', 'Portsmouth', 'Blackpool'], dtype=object)

In [160]:
df['Year'].unique()

array([2020, 2021, 2022, 2032], dtype=int64)

In [161]:
df['Year']= df['Year'].replace(2032,2022)

In [162]:
df['Year'].unique()

array([2020, 2021, 2022], dtype=int64)

In [163]:
df['Product category'].unique()

array(['Pastry', 'Coffee', 'Hot drinks', 'Cold drinks', 'Cakes',
       'Sandwiches', 'Pazztry', 'Sandwich', 'Colddrinks', 'Kakes'],
      dtype=object)

In [164]:
df['Product category']= df['Product category'].replace({'Colddrinks'},'Cold drinks')
df['Product category']= df['Product category'].replace('Pazztry','Pastry')
df['Product category']= df['Product category'].replace('Sandwich','Sandwiches')
df['Product category']= df['Product category'].replace('Kakes','Cakes')
df['Value']= df['Value'].str.replace('£','',regex=False)
df['Quantity']= df['Quantity'].replace('-','0')
df['Value']= df['Value'].str.replace(',','',regex=False)

In [165]:
df= df.rename(columns={'Product category':'Product'})
df.head()

          City  Year      Product Quantity Value Month
0  Southampton  2020       Pastry       96   192     8
1  Southampton  2020       Coffee      121   484     9
2  Southampton  2020   Hot drinks       42    84     9
3  Southampton  2020  Cold drinks       67   168     9
4  Southampton  2020        Cakes       27   135     9

In [166]:
df['Quantity']= pd.to_numeric (df['Quantity'])
df['Value']= pd.to_numeric (df['Value'])
df['Month']= pd.to_numeric(df['Month'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 601 entries, 0 to 600
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   City      601 non-null    object
 1   Year      601 non-null    int64
 2   Product   601 non-null    object
 3   Quantity  601 non-null    int64
 4   Value     601 non-null    int64
 5   Month     601 non-null    int64
dtypes: int64(4), object(2)
memory usage: 28.3+ KB

##### Concatenating dataframe

In [167]:
sales= pd.concat([df1,df],ignore_index=True)

In [168]:
sales.head()

          City  Year      Product  Quantity  Value  Month
0  Southampton  2020       Coffee        91    364      1
1  Southampton  2020   Hot drinks        46     92      1
2  Southampton  2020  Cold drinks        60    150      1
3  Southampton  2020        Cakes        23    115      1
4  Southampton  2020   Sandwiches        19    114      1

##### Data Enrichment

In [169]:
sales['Month_Name']= sales['Month'].apply(lambda x: calendar.month_name[x])
sales.head()

          City  Year      Product  Quantity  Value  Month Month_Name
0  Southampton  2020       Coffee        91    364      1    January
1  Southampton  2020   Hot drinks        46     92      1    January
2  Southampton  2020  Cold drinks        60    150      1    January
3  Southampton  2020        Cakes        23    115      1    January
4  Southampton  2020   Sandwiches        19    114      1    January

In [170]:
sales.dtypes

City          object
Year           int64
Product       object
Quantity       int64
Value          int64
Month          int64
Month_Name    object
dtype: object

##### Load Data into MySQL Database

* Integrating a connection and loading data into MySQL db

In [171]:
connection= 'mysql+pymysql://root:timjones24@localhost/practice'
engine= create_engine(connection)
sales.to_sql('coffee_sales',con=engine,if_exists='replace',index=False)

647

#### Conclusion

This ETL pipeline ensures data integrity,enhances readability and optimizes storage for efficient querying and reporting.


Project done by: Jones Osele
email: oselejones@gmail.com